IDEA Open Model
ConnectionCheckRes.ConnectionID Property
Compatible with IDEA StatiCa 20.1
 Guid of connection
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public Guid ConnectionID { get; set; }
Public Property ConnectionID As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
ConnectionCheckRes Class
IdeaRS.OpenModel.Connection Namespace